---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblem
source: html/1a2bec33-499d-2850-ba65-0e9b3bf70656.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblem Property

Dormer Opening Cut is not fully defined. Cut was not performed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DormerCutProblem { get; }
```